smash> submitted by Eran
smash> smash> smash> smash> [1] ./printSignals.exe &
[2] sleep 200&
[3] sleep 300&
smash> signal number 9 was sent to pid 51647
smash> smash> [1] ./printSignals.exe &
[3] sleep 300&
[4] sleep 400&
smash> smash> smash> smash> smash> smash> signal number 9 was sent to pid 51819
smash> signal number 5 was sent to pid 51646
smash> smash> [3] sleep 300&
[4] sleep 500&
smash> smash: sending SIGKILL signal to 2 jobs:
51648: sleep 300&
51950: sleep 500&
